app/Observers/TicketObserver.php

    public function updated(Ticket $ticket): void
    {
        if ($ticket->isDirty('status')) {
            TicketStatusHistory::create([
                'ticket_id' => $ticket->id,
                'old_status' => $ticket->getOriginal('status'),
                'new_status' => $ticket->status,
                'changed_by' => request()->user()?->id,
                'notes' => 'Status updated',
            ]);
---
insert into `ticket_status_histories` (`ticket_id`, `old_status`, `new_status`, `changed_by`, `notes`, `updated_at`, `created_at`) values (47, 'Need to Receive', 'In Progress', 1, 'Status updated', '2025-10-29 16:16:08', '2025-10-29 16:16:08')