app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `tickets` where `status` = 'pending' and `tickets`.`deleted_at` is null
select count(*) as aggregate from `tickets` where `status` = 'completed' and `tickets`.`deleted_at` is null
select count(*) as aggregate from `tickets` where `assigned_to` = 1 and `status` = 'ongoing' and `tickets`.`deleted_at` is null
select * from `tickets` where `tickets`.`deleted_at` is null order by `created_at` desc limit 5
---
    public function index(Request $request): Response
    {
        $statusCounts = Ticket::query()
            ->selectRaw('status, COUNT(*) as total')
            ->groupBy('status')
            ->pluck('total', 'status');

        $metrics = [
            'tickets_total' => Ticket::count(),
            'tickets_open' => $statusCounts['Open'] ?? 0,
            'tickets_need_receive' => $statusCounts['Need to Receive'] ?? 0,
            'tickets_in_progress' => $statusCounts['In Progress'] ?? 0,
            'tickets_finish' => $statusCounts['Finish'] ?? 0,
            'tickets_closed' => $statusCounts['Closed'] ?? 0,
            'engineers_total' => Engineer::count(),
            'special_places_total' => SpecialPlace::count(),
        ];

        $recentTickets = Ticket::query()
            ->with('assignedTo:id,name')
            ->latest()
            ->limit(5)
            ->get(['id', 'ticket_number', 'company', 'status', 'assigned_to', 'created_at'])
            ->map(static function (Ticket $ticket) {
                return [
                    'id' => $ticket->id,
                    'ticket_number' => $ticket->ticket_number,
                    'company' => $ticket->company,
                    'status' => $ticket->status,
                    'assigned_to' => $ticket->assignedTo?->name,
                    'created_at' => $ticket->created_at?->toDateTimeString(),
                ];
            });