app/Http/Controllers/TicketController.php

select * from `tickets` where `status` != 'Closed' and `tickets`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `tickets` where `status` != 'Closed' and `tickets`.`deleted_at` is null
---
    public function index(Request $request): Response
    {
        $query = Ticket::query()->with(['assignedTo', 'createdBy']);

        // Search functionality
        if ($request->has('search') && $request->search) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('ticket_number', 'like', "%{$search}%")
                    ->orWhere('case_id', 'like', "%{$search}%")
                    ->orWhere('company', 'like', "%{$search}%")
                    ->orWhere('problem', 'like', "%{$search}%");
            });
        }

        // Status filter
        if ($request->has('status') && $request->status) {
            if (strtolower($request->status) === 'open') {
                // 'Open' means all tickets except Closed
                $query->where('status', '!=', 'Closed');
            } else {
                // Specific status filter
                $query->where('status', $request->status);
            }
        }

        $tickets = $query->latest()->paginate(10)->withQueryString();

select `id`, `name`, `email` from `users`
---
    public function create(): Response
    {
        return Inertia::render('tickets/create', [
            'users' => \App\Models\User::select('id', 'name', 'email')->get(),
        ]);

select * from `ticket_status_histories` where `ticket_status_histories`.`ticket_id` in (24)
---
    public function show(Ticket $ticket): Response
    {
        return Inertia::render('tickets/show', [
            'ticket' => $ticket->load([
                'assignedTo',
                'createdBy',
                'statusHistories.changedBy',
            ]),
        ]);

select * from `ticket_status_histories` where `ticket_status_histories`.`ticket_id` in (1)
select * from `users` where `users`.`id` in (1)
---
    public function detail(Ticket $ticket): Response
    {
        $ticket->load([
            'assignedTo',
            'createdBy',
            'activities.user',
            'statusHistories.changedBy',
        ]);

select * from `users` where `users`.`id` in (1)
---
    public function timeline(Ticket $ticket): Response
    {
        $ticket->load(['assignedTo', 'createdBy', 'activities.user']);

insert into `ticket_activities` (`activity_type`, `title`, `description`, `activity_time`, `user_id`, `visit_number`, `ticket_id`, `updated_at`, `created_at`) values ('received', 'Received Ticket', null, '2025-10-29 16:16:00', 1, 1, 47, '2025-10-29 16:16:08', '2025-10-29 16:16:08')
update `tickets` set `status` = 'In Progress', `tickets`.`updated_at` = '2025-10-29 16:16:08' where `id` = 47
---
    public function addActivity(Request $request, Ticket $ticket)
    {
        // Prevent adding activity to closed tickets
        if ($ticket->status === 'Closed') {
            return back()->withErrors(['error' => 'Cannot add activity to a closed ticket.']);
        }

        $validated = $request->validate([
            'activity_type' => 'required|in:received,on_the_way,arrived,start_working,need_part,completed,revisit,status_change,note',
            'title' => 'required|string|max:255',
            'description' => 'nullable|string',
            'activity_time' => 'required|date',
        ]);

        // Update ticket status based on activity type
        $statusMap = [
            'received' => 'In Progress',
            'on_the_way' => 'In Progress',
            'arrived' => 'In Progress',
            'start_working' => 'In Progress',
            'completed' => 'Resolved',
        ];

        $newStatus = $statusMap[$validated['activity_type']] ?? $ticket->status;

        $ticket->activities()->create([
            ...$validated,
            'user_id' => $request->user()->id,
            'visit_number' => $ticket->current_visit,
        ]);

        // Update ticket status
        $ticket->update(['status' => $newStatus]);