app/Http/Controllers/TicketController.php

    public function detail(Ticket $ticket): Response
    {
        $ticket->load([
            'assignedTo',
            'createdBy',
            'activities.user',
            'statusHistories.changedBy',
        ]);
---
select * from `ticket_status_histories` where `ticket_status_histories`.`ticket_id` in (15)

    public function timeline(Ticket $ticket): Response
    {
        $ticket->load(['assignedTo', 'createdBy', 'activities.user']);
---
select * from `users` where `users`.`id` in (1)