app/Http/Controllers/TicketController.php

select `id`, `name`, `email` from `users`
---
    public function edit(Ticket $ticket): Response
    {
        return Inertia::render('tickets/edit', [
            'ticket' => $ticket,
            'users' => \App\Models\User::select('id', 'name', 'email')->get(),
        ]);

select * from `users` where `users`.`id` in (1)
---
    public function timeline(Ticket $ticket): Response
    {
        return Inertia::render('tickets/timeline', [
            'ticket' => $ticket->load(['assignedTo', 'createdBy', 'activities.user']),
        ]);

insert into `ticket_activities` (`activity_type`, `title`, `description`, `activity_time`, `user_id`, `visit_number`, `ticket_id`, `updated_at`, `created_at`) values ('on_the_way', 'On The Road', null, '2025-10-29 14:41:00', 1, 1, 92, '2025-10-29 14:41:45', '2025-10-29 14:41:45')
---
    public function addActivity(Request $request, Ticket $ticket)
    {
        // Prevent adding activity to closed tickets
        if ($ticket->status === 'Closed') {
            return back()->withErrors(['error' => 'Cannot add activity to a closed ticket.']);
        }

        $validated = $request->validate([
            'activity_type' => 'required|in:received,on_the_way,arrived,start_working,need_part,completed,revisit,status_change,note',
            'title' => 'required|string|max:255',
            'description' => 'nullable|string',
            'activity_time' => 'required|date',
        ]);

        // Update ticket status based on activity type
        $statusMap = [
            'received' => 'In Progress',
            'on_the_way' => 'In Progress',
            'arrived' => 'In Progress',
            'start_working' => 'In Progress',
            'completed' => 'Resolved',
        ];

        $newStatus = $statusMap[$validated['activity_type']] ?? $ticket->status;

        $ticket->activities()->create([
            ...$validated,
            'user_id' => $request->user()->id,
            'visit_number' => $ticket->current_visit,
        ]);